In [ ]:
# pandas 설치
!pip install pandas

In [ ]:
import pandas as pd 
import numpy as np

In [ ]:
obj = ["이유리", "최민준", "김민지"]
print(type(obj))

series_1 = pd.Series(obj)
print(type(series_1))
print(series_1)

In [ ]:
obj = ["이유리", "최민준", "김민지"]
idx = ["A", "B", "C"]

series_2 = pd.Series(["이유리", "최민준", "김민지"], index=idx)
print(series_2)

In [ ]:
obj = {
    "A": "이유리", 
    "B": "최민준", 
    "C": "김민지", 
}

series_3 = pd.Series(obj)
print(series_3)

In [ ]:
# values 속성
print(series_1.values)

In [ ]:
# index 속성
print(series_1.index)

In [ ]:
# dtypes 속성 -> 시리즈 객체의 데이터 타입 확인
print(series_1.dtypes)

In [ ]:
# size 속성 -> 총 객체의 수
print(series_1.size)

In [ ]:

series_1.index = ["A", "B", "C"]
print(series_1.index)

In [ ]:
obj = [22, 32, 27, 18, 38, 19]
idx = list("abcdef") # => ["a", "b", "c", "d", "e", "f"]

sr = pd.Series(obj, index=idx)
print(sr)

In [ ]:
# Series 객체의 인덱싱
print(sr[4])
print(sr[-1])
print(sr["c"])

In [ ]:
# Series 객체의 슬라이싱 
print(sr[1:5])
print(sr[:5])

In [ ]:
print(sr["b":"d"])

In [ ]:
idx = [0, 3, 4]
print(sr[idx])
print(sr[[1, 5]])

In [ ]:
print(sr)

In [ ]:
print(sr[["b", "d", "f"]])

In [ ]:
# 통계 매소드 

sr_1 = pd.Series(range(100)) # range(100) -> [0, 1, 2, .... 99]
print(sr_1)

In [ ]:
# 집계함수 describe() -> 요약 통계량에 대한 정보 
sr_1.describe()

In [ ]:
# 집계함수 count() => 총 객체 수 
sr_1.count()

In [ ]:
# 집계함수 mean() 평균
sr_1.mean()

In [ ]:
# 집계함수 var() 분산
sr_1.var()

In [ ]:
# 집계함수 std() 표준편차
sr_1.std()

In [ ]:
print(sr_1.min())
print(sr_1.max())
print(sr_1.median())

In [ ]:
# quantile() 백분위수
print(sr_1.quantile())
print(sr_1.quantile(q=0.25))
print(sr_1.quantile(q=0.75))

In [ ]:
sr_2 = pd.Series(["a", "b", "b", "b", "c", "c", "d"])
sr_2.describe()

In [ ]:
# unique() -> 유일한 값 확인
sr_2.unique()

In [ ]:
# value_counts -> 유일한 값의 빈도수 확인
sr_2.value_counts()

In [ ]:
# mode 최빈값
sr_2.mode()

In [1]:
# 데이터프레임 

import pandas as pd

obj1 = {
    "이름": ["이유리", "최민준", "김민지"], 
    "전공": ["경영학과", "컴퓨터공학과", "데이터과학과"], 
    "성별": ["여", "남", "여"], 
    "나이": [20, 22, 21]
}

df_1 = pd.DataFrame(obj1)
print(df_1)
print(type(df_1))

    이름      전공 성별  나이
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터과학과  여  21
<class 'pandas.core.frame.DataFrame'>

In [3]:
import numpy as np

In [4]:
obj2 = np.array([
    ["이유리", "경영학과", "여", 20], 
    ["최민준", "컴퓨터공학과", "남", 22], 
    ["김민지", "데이터과학과", "여", 21], 
])

df_2 = pd.DataFrame(obj2)
print(df_2)

     0       1  2   3
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터과학과  여  21

In [5]:
df_3 = pd.DataFrame(
                    obj2, 
                    columns=["Name", "Major", "Sex", "Age"], 
                    index=["A", "B", "C"]
                    )
print(df_3)

  Name   Major Sex Age
A  이유리    경영학과   여  20
B  최민준  컴퓨터공학과   남  22
C  김민지  데이터과학과   여  21

In [6]:
obj = {
    "Name": ["Olivia", "Lucas", "Sophia", "Zoe", "Ava", "Elliot"], 
    "Sex": ["Female", "Male", "Female", "Female", "Female", "Male"], 
    "Age": [22, 32, 27, 18, 38, 19]
}

df = pd.DataFrame(obj)
df

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [7]:
a = df.values
print(a)
print("-"*24)
print(type(a))

[['Olivia' 'Female' 22]
 ['Lucas' 'Male' 32]
 ['Sophia' 'Female' 27]
 ['Zoe' 'Female' 18]
 ['Ava' 'Female' 38]
 ['Elliot' 'Male' 19]]
------------------------
<class 'numpy.ndarray'>

In [8]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
df.columns

Index(['Name', 'Sex', 'Age'], dtype='object')

In [10]:
df.dtypes

Name    object
Sex     object
Age      int64
dtype: object

In [11]:
df.shape

(6, 3)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Sex     6 non-null      object
 2   Age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [13]:
df.head()

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38

In [14]:
df.head(1)

     Name     Sex  Age
0  Olivia  Female   22

In [ ]:
df.head(-3)

In [ ]:
df

In [15]:
df.tail()

     Name     Sex  Age
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [ ]:
df.tail(-2)

In [16]:
obj = {
    "Name": ["Olivia", "Lucas", "Sophia", "Zoe", "Ava", "Elliot"], 
    "Sex": ["Female", "Male", "Female", "Female", "Female", "Male"], 
    "Age": [22, 32, 27, 18, 38, 19]
}

idx = list("abcdef") # -> ["a", "b" ... "f"]
df = pd.DataFrame(obj, index=idx)
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    Male   19

In [17]:
print(df["Name"])

a    Olivia
b     Lucas
c    Sophia
d       Zoe
e       Ava
f    Elliot
Name: Name, dtype: object

In [ ]:
print(df.Name)

In [ ]:
print(df[["Name", "Age"]])

In [ ]:
df.iloc[0]

In [ ]:
df.iloc[1]

In [ ]:
df.iloc[1:5]

In [18]:
df.iloc[[1, 3, 5]]

     Name     Sex  Age
b   Lucas    Male   32
d     Zoe  Female   18
f  Elliot    Male   19

In [19]:
df.loc["b"]

Name    Lucas
Sex      Male
Age        32
Name: b, dtype: object

In [20]:
df.loc["b":"e"]

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38

In [21]:
df.loc[["a", "c", "e"]]

     Name     Sex  Age
a  Olivia  Female   22
c  Sophia  Female   27
e     Ava  Female   38

In [23]:
# print(df["Age"][0])
print(df["Age"]["a"])
df

22

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    Male   19

In [ ]:
print(df.loc["a"]["Age"])

In [24]:
df.iloc[1:4, 1:3]

      Sex  Age
b    Male   32
c  Female   27
d  Female   18

In [25]:
df.loc["b", "Name"]

'Lucas'

In [26]:
rownm = ["b", "d", "e"]
colnm = ["Name", "Sex"]

# df.loc[["b", "d", "e"], ["Name", "Sex"]]
df.loc[rownm, colnm]

    Name     Sex
b  Lucas    Male
d    Zoe  Female
e    Ava  Female

In [69]:
obj = {
    "Name": ["Olivia", "Lucas", "Sophia", "Zoe", "Ava", "Elliot"], 
    "Sex": ["Female", "Male", "Female", "Female", "Female", "Male"], 
    "Age": [22, 32, 27, 18, 38, 19], 
    "Score": [100, 95, 60, 77, 83, 84], 
}

df = pd.DataFrame(obj)
df

     Name     Sex  Age  Score
0  Olivia  Female   22    100
1   Lucas    Male   32     95
2  Sophia  Female   27     60
3     Zoe  Female   18     77
4     Ava  Female   38     83
5  Elliot    Male   19     84

In [70]:
df.describe()

             Age       Score
count   6.000000    6.000000
mean   26.000000   83.166667
std     7.874008   14.133884
min    18.000000   60.000000
25%    19.750000   78.500000
50%    24.500000   83.500000
75%    30.750000   92.250000
max    38.000000  100.000000